<template>
  <div class="container">
    <div class="d-flex justify-content-center">
      <h1>PhotoParserX</h1>
    </div>
    <div>
      PhotoParserX - Это программа, основной целью которой является поиск и скачивание огромного количества фотографий с
      интернета. Программа работает в паре с метапоисковой системой "searx" и поднимает собственный экземпляр этой системы
      для нужд поиска фотографий.
    </div>
    <div class="mt-3">
      Параметры поиска вы можете настроить на странице поиска перед тем, как сделать запрос. Ниже строки запроса есть 4
      блока настроек в порядке перечисления:
      <ul>
        <li>Количество страниц поиска (на одну страницу примерно 50-60 фотографий)</li>
        <li>Язык поиска</li>
        <li>Временной интервал</li>
        <li>Timeout поискового запроса(При большом количестве страниц может потребоваться его увеличить)</li>
      </ul>
      После того, как все настроено, можно приступать к поиску. Введя запрос и нажав кнопку поиска, можно посмотреть
      статус запроса во вкладке "История". Там же можно выполнить различные действия с выполненым запросом, такие как:
      <ul>
        <li>Просмотр результатов запроса</li>
        <li>Создание архива с результатами запроса и последующее его скачивание</li>
        <li>Удаление запроса из истории</li>
      </ul>
      Можно делать запросы, не дожидаясь завершения текущих запросов, программа выполнит их последовательно в порядке добавления в список. Приятного пользования!
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {};
  },
  methods: {}
}
</script>